tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

brew "autojump"
brew "bat"
brew "buildkit"
brew "coreutils"
brew "d2"
brew "direnv"
brew "gitup"
brew "go"
brew "httpie"
brew "mas"
brew "pre-commit"
brew "pure"
brew "python@3.10"
brew "tldr"
brew "wget"
brew "zsh-completions"

cask "datagrip"
cask "firefox"
cask "font-jetbrains-mono"
cask "goland"
cask "insomnia"
cask "karabiner-elements"
cask "keepassxc"
cask "linearmouse"
cask "monitorcontrol"
cask "mos"
cask "orbstack"
cask "pycharm"
cask "rectangle-pro"
cask "visual-studio-code"

vscode "Arjun.swagger-viewer"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "JakeBecker.elixir-ls"
vscode "PeterSchmalfeldt.explorer-exclude"
vscode "Terrastruct.d2"
vscode "adpyke.vscode-sql-formatter"
vscode "codezombiech.gitignore"
vscode "donjayamanne.python-environment-manager"
vscode "foxundermoon.shell-format"
vscode "golang.go"
vscode "jdinhlife.gruvbox"
vscode "jinliming2.vscode-go-template"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "phoenixframework.phoenix"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
