tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

brew "autojump"
brew "bat"
brew "buildkit"
brew "coreutils"
brew "d2"
brew "direnv"
brew "elixir"
brew "git-crypt"
brew "gitup"
brew "go"
brew "httpie"
brew "mas"
brew "pre-commit"
brew "pure"
brew "python@3.10"
brew "restic"
brew "tldr"
brew "vdirsyncer"
brew "wget"
brew "zsh-completions"

cask "autodesk-fusion360"
cask "beekeeper-studio"
cask "elmedia-player"
cask "firefox"
cask "font-jetbrains-mono"
cask "insomnia"
cask "karabiner-elements"
cask "keepassxc"
cask "linearmouse"
cask "messenger"
cask "monitorcontrol"
cask "mos"
cask "obsidian"
cask "orbstack"
cask "orion"
cask "postgres-unofficial"
cask "prusaslicer"
cask "qnapi"
cask "rectangle-pro"
cask "slack"
cask "sonos"
cask "spotify"
cask "steam"
cask "transmission"
cask "utm"
cask "visual-studio-code"

mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

vscode "Arjun.swagger-viewer"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "JakeBecker.elixir-ls"
vscode "PeterSchmalfeldt.explorer-exclude"
vscode "Terrastruct.d2"
vscode "adpyke.vscode-sql-formatter"
vscode "codezombiech.gitignore"
vscode "donjayamanne.python-environment-manager"
vscode "foxundermoon.shell-format"
vscode "golang.go"
vscode "jdinhlife.gruvbox"
vscode "jinliming2.vscode-go-template"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "phoenixframework.phoenix"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
