tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

brew "autojump"
brew "bat"
brew "buildkit"
brew "coreutils"
brew "d2"
brew "direnv"
brew "elixir"
brew "ffmpeg"
brew "flyctl"
brew "gh"
brew "git-crypt"
brew "gitup"
brew "go"
brew "httpie"
brew "mas"
brew "node"
brew "pre-commit"
brew "pure"
brew "python@3.10"
brew "restic"
brew "tldr"
brew "vdirsyncer"
brew "wget"
brew "youtube-dl"
brew "zsh-completions"

cask "beekeeper-studio"
cask "copilot-for-xcode"
cask "cryptomator"
cask "cyberduck"
cask "elmedia-player"
cask "firefox"
cask "font-jetbrains-mono"
cask "karabiner-elements"
cask "keepassxc"
cask "livebook"
cask "mactex-no-gui"
cask "messenger"
cask "monitorcontrol"
cask "mos"
cask "nvidia-geforce-now"
cask "obsidian"
cask "onyx"
cask "orbstack"
cask "platypus"
cask "postgres-unofficial"
cask "proxy-audio-device"
cask "prusaslicer"
cask "rapidapi"
cask "rectangle-pro"
cask "sf-symbols"
cask "slack"
cask "sonos"
cask "spotify"
cask "sublime-merge"
cask "swiftformat-for-xcode"
cask "switchresx"
cask "transmission"
cask "visual-studio-code"

mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
