tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

brew "autojump"
brew "bat"
brew "buildkit"
brew "coreutils"
brew "d2"
brew "direnv"
brew "ffmpeg"
brew "gitup"
brew "go"
brew "golangci-lint"
brew "httpie"
brew "mas"
brew "poetry"
brew "pre-commit"
brew "pure"
brew "python@3.10"
brew "redis"
brew "tldr"
brew "wget"
brew "zsh-completions"

cask "bruno"
cask "datagrip"
cask "firefox"
cask "font-jetbrains-mono"
cask "karabiner-elements"
cask "keepassxc"
cask "microsoft-teams"
cask "monitorcontrol"
cask "mos"
cask "onyx"
cask "openvpn-connect"
cask "orbstack"
cask "proxy-audio-device"
cask "rectangle-pro"
cask "sublime-merge"
cask "visual-studio-code"
